app/views/tasks/_form.html.erb

SELECT "groups".* FROM "groups"
---
  <div class="input-group">
    <%= f.select :group_id, options_for_select(Group.all.collect { |g| [g.name, g.id] }) %>