app/views/tasks/_task.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<li class="task-item alert <%= task_class(task.status)%>" role="alert">
  <p class="task-group" title="<%= task.group.name %>"><%= task.group.name %></p>