app/controllers/groups_controller.rb

INSERT INTO "groups" ("name", "user_id") VALUES (?, ?)  [["name", "tes"], ["user_id", 8]]
INSERT INTO "groups" ("name", "user_id") VALUES (?, ?)  [["name", "1312312312"], ["user_id", 8]]
---
  def create
    @group = current_user.groups.create(group_params)
    return if @group.invalid?
    @group.save