app/controllers/tasks_controller.rb

  def index
    @task = Task.new
    @group = Group.new
    @tasks = Task.for_dashboard(params).where(user_id: params[:user_id] || current_user)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]

  def create
    @task = current_user.tasks.create(task_params)
---
INSERT INTO "tasks" ("title", "description", "expire_at", "created_at", "updated_at", "user_id", "group_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    task.update(update_task_params)
---
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", 1], ["updated_at", "2018-12-07 21:44:09.435117"], ["id", 4]]

  def destroy
    Task.delete(params[:id])
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 7]]

  def task
    @task ||= current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 8], ["id", 4], ["LIMIT", 1]]